Repository: 84000/data-translation-memory
Catalog: toh84_84000-the-questions-of-the-girl-vimalasraddha.tmx
Source language: bo
Languages: en

source: དགེ་བའི་རྩ་བ་ཡངས་ཤིང་རྒྱ་ཆེ་བའི་ཕྱིར་དང་། སེམས་ཅན་ལ་སོ་སོར་རྟོག་པར་བྱེད་པའི་ཕྱིར་དང་། རྟག་པར་དེ་བཞིན་གཤེགས་པ་རྣམས་མཐོང་ཞིང་མཆོད་པ་བྱེད་པའི་ཕྱིར་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་རྣམས་མཐོང་བའི་ཕྱིར་དང་། རྟག་པར་སངས་རྒྱས་ཀྱི་མཁྱེན་པ་ཡོངས་སུ་གཉེར་བའི་ཕྱིར་དང་། འཁོར་བ་རྨི་ལམ་ལྟ་བུར་རབ་ཏུ་རྟོགས་པའི་ཕྱིར་དང་། ཆོས་ཁྱད་པར་ཅན་དག་ལ་ཞུམ་པ་མེད་པའི་ཕྱིར་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་དང་ཡང་དག་པའི་མཐའ་ལ་སོ་སོར་རྟོག་པའི་ཕྱིར་རོ།
en: because they see innumerable buddhafields; because they always strive for the knowledge of a buddha; because they understand that saṃsāra is like a dream; because they are not intimidated by the excellent Dharma; and because they have distinct comprehension of the beginning, the end, and the real endpoint.”

source: རྣལ་འབྱོར་ལམ་ནི་གང་སྒོམ་པ།
en: “Meditators on the yogin’s path

source: །དགེ་སྦྱོང་སྐྱོན་འཕེན་དྲི་མ་མེད།
en: Eradicate their faults and become unstained,

source: །བར་སྣང་ཟླ་བ་རྣམ་དག་བཞིན།
en: Like the pure moon in the sky;

source: །སྡུག་བསྔལ་སེམས་ཅན་སྒྲོལ་བར་བྱེད།
en: They liberate sentient beings from their suffering.

source: །ཡོན་ཏན་རྣམས་ནི་བསྡུ་བའི་ཕྱིར།
en: Because they gather qualities,

source: །འཁོར་བས་ཡོངས་སུ་ངལ་མི་འགྱུར།
en: They do not become exhausted by saṃsāra.

source: །སེམས་ཅན་རང་བཞིན་རྟོག་བྱེད་ཅིང་།
en: “They consider the nature of all sentient beings,

source: །རབ་བརྟེན་བརྩོན་འགྲུས་སྤྱོད་པར་བྱེད། །སངས་རྒྱས་ཞིང་ནི་ཚད་མེད་དུ།
en: And they act with steadfast perseverance.

source: །སངས་རྒྱས་རྣམས་ནི་གུས་མཆོད་པས།
en: Devotedly making offerings To buddhas in immeasurable buddhafields,

source: །དེ་ཕྱིར་སྟོབས་བཅུ་གང་ལྡན་པ།
en: They thereby become endowed with the ten strengths,

source: །འཇིག་རྟེན་ཚད་མེད་དཔག་མེད་དུ། །བསམ་གྱིས་མི་ཁྱབ་ཆོས་སྟོན་ཅིང་།
en: In innumerable, infinite worlds,

source: །དཀོན་མཆོག་གསུམ་གྱི་གདུང་མི་གཅོད།
en: They maintain uninterrupted the lineage of the Three Jewels

source: །ཆོས་རྒྱལ་ཉིད་དུ་མངོན་འཚང་རྒྱ།
en: And become fully awakened as Dharma Kings.

source: །ཚུལ་ཁྲིམས་དམ་པ་གང་སྲུང་བ།
en: Those who preserve excellent discipline

source: །འཁོར་བས་ངལ་བར་མི་འགྱུར་ཞིང་།
en: Do not become exhausted by saṃsāra,

source: །འཁོར་བའི་རང་བཞིན་གང་ཡིན་པ།
en: “And they recognize that the nature of saṃsāra

source: །རྨི་ལམ་སྤྲིན་དང་གློག་ལྟར་ཤེས།
en: Is like a dream, a cloud, or a flash of lightning.

source: །ཆོས་ལས་གང་ཞིག་རྣམ་གྲོལ་བ།
en: Those who find liberation through the Dharma

source: །བྱང་ཆུབ་ལ་ནི་རབ་གནས་ཤིང་།
en: “Remaining in an awakened state,

source: །དགའ་བའི་སེམས་ཀྱིས་རྟག་ཏུ་བདེ།
en: With their joyful minds, they are always happy.

source: །ཐབས་ཀྱིས་ཕ་རོལ་གང་ཕྱིན་པ།
en: Those who have become accomplished through skillful means

source: །རྟག་པར་དམ་ཆོས་སྒྲུབ་པ་ཡང་།
en: “Constantly practicing the excellent Dharma,

source: །བར་སྣང་ཟླ་བཞིན་འཕེལ་བར་འགྱུར།
en: Their realization increases, like the waxing moon in the sky.

source: །སངས་རྒྱས་ཡོན་ཏན་གང་མོས་པ།
en: Those who aspire to the Buddha’s qualities

source: །འཁོར་བ་མུ་མཐའ་མེད་གྱུར་ཀྱང་།
en: “And, although saṃsāra is endless,

source: །རྟག་པར་ཡང་དག་མཐའ་ལ་གནས།
en: They always dwell in the real endpoint.

source: །ཡུད་ཙམ་ཤེས་རབ་རྗེས་འཐུན་པ།
en: Those who are attuned to insight, even for just a moment,

source: །འཁོར་བ་དག་གིས་ངལ་མི་འགྱུར།
en: Do not become exhausted by saṃsāra.

source: །གཞན་ཡང་བུ་མོ་ཆོས་བརྒྱད་དང་ལྡན་ན་སེམས་ཀྱི་ཁམས་མཉམ་པར་འགྱུར་རོ། །བརྒྱད་གང་ཞེ་ན།
en: “Furthermore, girl, when it is endowed with eight qualities, the mind’s constitution will be balanced. What are these eight qualities?

source: སེམས་ས་དང་མཚུངས་པར་གྱུར་པའི་ཕྱིར་དང་། སེམས་ཆུ་དང་མཚུངས་པར་གྱུར་པའི་ཕྱིར་དང་། སེམས་མེ་དང་མཚུངས་པར་གྱུར་པའི་ཕྱིར་དང་། སེམས་རླུང་དང་མཚུངས་པར་གྱུར་པའི་ཕྱིར་དང་། སེམས་ནམ་མཁའ་དང་མཚུངས་པར་གྱུར་པའི་ཕྱིར་དང་། སེམས་ཆོས་ཀྱི་དབྱིངས་དང་མཚུངས་པར་གྱུར་པའི་ཕྱིར་དང་། སེམས་རྣམ་པར་གྲོལ་བ་དང་མཚུངས་པར་གྱུར་པའི་ཕྱིར་དང་། སེམས་མྱ་ངན་ལས་འདས་པ་དང་མཚུངས་པར་གྱུར་པའི་ཕྱིར་ཏེ།
en: The mind will be of balanced constitution because the mind has become similar to earth; because the mind has become similar to water; because the mind has become similar to fire; because the mind has become similar to air; because the mind has become similar to space; because the mind has become similar to the expanse of reality; because the mind has become similar to liberation; and because the mind has become similar to nirvāṇa.

source: འདི་ནི་སེམས་ཀྱི་ཁམས་མཉམ་པ་ཉིད་རྣམ་པ་བརྒྱད་ཅེས་བྱའོ།
en: These are called the eight kinds of balanced constitution of the mind.”

source: སེམས་ནི་ས་དང་མཚུངས་པས་ན།
en: “Because the mind is similar to earth,

source: །ཐམས་ཅད་ཁུར་དུ་ཁྱེར་བར་བྱེད།
en: It can carry any load,

source: །དགེ་བ་དང་ནི་སྡིག་པ་འང་རུང་།
en: And, whether there is virtue or nonvirtue,

source: །འཕེལ་བ་མེད་ཅིང་འགྲིབ་པ་མེད།
en: It never increases or diminishes.

source: །སེམས་ནི་ཆུ་དང་མཚུངས་པས་ན།
en: “Because the mind is similar to water,

source: །དྲི་མ་མི་གཙང་འཁྲུ་བྱེད་ཅིང་།
en: It washes away all stains and impurities

source: །འཇིག་རྟེན་རྣམས་ནི་གསོ་བ་དང་། །ཉོན་མོངས་གདུང་བ་སེལ་བར་བྱེད།
en: And, nourishing all worlds, Dispels the distress of the afflictions.

source: །སེམས་ནི་མེ་དང་མཚུངས་པས་ན།
en: “Because the mind is similar to fire,

source: །ཉོན་མོངས་དག་ནི་སྲེག་བྱེད་ཅིང་།
en: It burns away all the afflictions,

source: །སྒྲོན་མ་ཆེན་པོ་སྣང་བ་ཡིས།
en: And, like the light of a huge torch,

source: །གསལ་བར་མི་བྱེད་གང་ཡང་མེད།
en: There is nothing it does not illuminate.

source: །སེམས་ནི་རླུང་དང་མཚུངས་པས་ན།
en: “Because the mind is similar to wind,

source: །གནས་པ་མེད་ཅིང་རྟེན་མེད་པར།
en: It neither dwells anywhere nor depends on anything,

source: །ཚུལ་ཁྲིམས་ཐོས་པའི་དྲི་ཡིས་ནི།
en: And the fragrance of discipline and learning

source: །དུས་གསུམ་ཀུན་ཏུ་ཁྱབ་པར་བྱེད།
en: Pervades everywhere throughout the three times.

source: །སེམས་ནི་ནམ་མཁའ་མཚུངས་པས་ན།
en: “Because the mind is similar to space,

source: །ལྟ་བ་སྤོང་ཞིང་རྣམ་པར་དག །ཐམས་ཅད་ཀུན་ཏུ་འཇུག་བྱེད་ཀྱང་།
en: It is free from views and completely pure, And, although it interacts with everything,

source: །བདུད་ཀྱི་རྗེས་སུ་འབྲང་མི་བྱེད།
en: It does not follow after Māra.

source: །སེམས་ནི་ཆོས་དབྱིངས་མཚུངས་པས་ན།
en: “Because the mind is similar to the expanse of reality,

source: །བདེ་བ་ཉིད་དུ་རབ་གནས་ཤིང་།
en: It is established in the very essence of bliss

source: །འཕེལ་བ་མེད་ཅིང་འགྲིབ་མེད་པར།
en: And, without ever increasing or diminishing,

source: །རྟག་པར་མཉམ་པ་ཉིད་ལ་གནས། །ཉན་ཐོས་དང་ནི་རང་རྒྱལ་གྱི།
en: Always dwells in equanimity.

source: །རྣམ་པར་གྲོལ་བ་ཐོབ་གྱུར་ཀྱང་།
en: “Even when liberation is attained By hearers and the solitary realizers,

source: །འཆིང་བ་དག་ཀྱང་ཡོད་མིན་ལ།
en: There is neither bondage,

source: །གྲོལ་བ་དག་ཀྱང་ཡོད་པ་མིན།
en: Nor is there liberation.

source: །འཁོར་བ་དང་ནི་མྱ་ངན་འདས།
en: “Saṃsāra and nirvāṇa

source: །འོང་བ་མེད་ཅིང་འགྲོ་མེད་ཅེས།
en: Are said to be beyond coming and going,

source: །རབ་དབེན་ཉེར་ཞིར་གནས་ནས་ནི།
en: So, peacefully maintaining disengagement,

source: །དུས་གསུམ་ཀུན་ཏུ་འགྲོ་བར་བྱེད།
en: One acts everywhere throughout the three times.

source: །གཞན་ཡང་བུ་མོ་ཆོས་རྣམ་པ་བརྒྱད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་ཀྱི་འབྱུང་གནས་སུ་འགྱུར་རོ། །བརྒྱད་གང་ཞེ་ན།
en: “Furthermore, girl, when bodhisattvas are endowed with eight qualities, they become sources of awakening. What are these eight qualities?

source: དང་པོ་ནི་སྦྱིན་པ་འབྱུང་གནས་སུ་གྱུར་པ་ཡིན་ཏེ། ཅི་བདོག་པ་རྣམས་ཡོངས་སུ་གཏོང་བའི་ཕྱིར་རོ།
en: First, they have become sources of generosity, because they give away everything they own.

source: །གཉིས་པ་ནི་ཚུལ་ཁྲིམས་འབྱུང་གནས་སུ་གྱུར་པ་ཡིན་ཏེ། ཉམས་པ་མེད་པའི་ཕྱིར་རོ།
en: Second, they have become sources of discipline, because they are free of transgressions.

source: །གསུམ་པ་ནི་བཟོད་པ་འབྱུང་གནས་སུ་གྱུར་པ་ཡིན་ཏེ། ཞེ་སྡང་མེད་པའི་ཕྱིར་རོ།
en: Third, they have become sources of patience, because they are free of aggression.

source: །བཞི་པ་ནི་བརྩོན་འགྲུས་འབྱུང་གནས་སུ་གྱུར་པ་ཡིན་ཏེ། །ལེ་ལོ་མེད་ཅིང་ནུར་བ་མེད་པའི་ཕྱིར་རོ།
en: Fourth, they have become sources of perseverance, because they are free of laziness and doubt.

source: །ལྔ་པ་ནི་བསམ་གཏན་འབྱུང་གནས་སུ་གྱུར་པ་ཡིན་ཏེ། ཐབས་ལ་མཁས་པའི་ཕྱིར་རོ།
en: Fifth, they have become sources of concentration, because they are skillful in means.

source: །དྲུག་པ་ནི་ཤེས་རབ་འབྱུང་གནས་སུ་གྱུར་པ་ཡིན་ཏེ། ཚུལ་ཁྲིམས་སྲུང་ཞིང་མང་དུ་ཐོས་པ་དང་ལྡན་པའི་ཕྱིར་རོ།
en: Sixth, they have become sources of insight, because they maintain discipline and have vast learning.

source: །བདུན་པ་ནི་ཚངས་པའི་གནས་པ་འབྱུང་གནས་སུ་གྱུར་པ་ཡིན་ཏེ། རྣམ་པར་གྲོལ་བས་ཉེ་བར་ཞི་བར་འགྱུར་བའི་ཕྱིར་རོ། །བརྒྱད་པ་ནི་མངོན་པར་ཤེས་པ་འབྱུང་གནས་སུ་གྱུར་པ་ཡིན་ཏེ། རྟག་པར་མཉམ་པར་བཞག་པ་ལ་རབ་ཏུ་གནས་པའི་ཕྱིར་རོ།
en: Seventh, they have become sources of the abodes of Brahmā, because they are fully at peace through complete liberation. Eighth, they have become sources of supernormal powers, because they constantly maintain concentration.”

source: རྟག་པར་སྦྱིན་པ་གང་གཏོང་བ།
en: “Since those who constantly practice generosity

source: །འདོད་ཆགས་གདུང་བ་སྤོང་བས་ན།
en: Abandon the agony of desire,

source: །འབྲས་བུ་རྣམ་སྨིན་མི་རེ་བར།
en: They do not seek the maturation of karmic fruit,

source: །སངས་རྒྱས་བྱང་ཆུབ་སྔོ་བར་བྱེད།
en: And dedicate all their merit to the awakening of a buddha.

source: །ཁྲིམས་ལྡན་ཐེག་པ་ཆེ་བའི་ཕྱིར།
en: “Because practitioners of the Great Vehicle have discipline,

source: །བཅད་ཅིང་གཏུབས་ཀྱང་ཁོང་ཁྲོ་མེད།
en: They are without anger, even when cut and torn apart.

source: །རྩེ་གཅིག་བདེ་ཆེན་གཉེར་བྱེད་ཅིང་།
en: Striving one-pointedly for great bliss, and abandoning all habitual patterns,

source: །བག་ཆགས་སྤངས་ནས་འགོག་མངོན་མེད།
en: They never meet any real obstacle.

source: །བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་ཅན།
en: “Bodhisattvas endowed with perseverance,

source: །བསྐལ་མང་སེམས་ཅན་ཆེད་དུ་ནི།
en: For the sake of sentient beings and for many eons,

source: །སྡུག་བསྔལ་བཟོད་ཅིང་འཇིག་རྟེན་རྒྱུ།
en: Bear suffering and wander through countless worlds,

source: །བརྩོན་འགྲུས་སྟོབས་ནི་འཕེལ་བར་བྱེད།
en: Increasing the strength of their perseverance.

source: །བསམ་གཏན་དག་ནི་གང་སྒོམ་པ།
en: “Those who cultivate concentration

source: །སྤྲོས་པ་རྣམས་ནི་སྤོང་བྱེད་ཅིང་།
en: Abandon all kinds of elaboration,

source: །བསམ་གཏན་ཕ་རོལ་ཕྱིན་གྱུར་ཀྱང་།
en: And, although they have perfected concentration,

source: །བསམ་གཏན་རྗེས་སུ་ཡོང་མི་སྐྱེ།
en: They do not get caught up in concentration.

source: །ཤེས་རབ་ཆེན་པོ་མཚུངས་མེད་པས།
en: “Through incomparable great insight,

source: །མཐར་ལྟ་རྣམས་ནི་སྤོང་བྱེད་ཅིང་།
en: They abandon extreme views

source: །འཇིག་རྟེན་སྟོང་དབེན་རིག་པས་ན།
en: And, with knowledge that the world is empty,

source: །གཏི་མུག་མུན་པ་མ་ལུས་སེལ།
en: Dispel all the darkness of delusion.

source: །ཉེར་ཞི་ཚངས་གནས་གང་སྒོམ་པ།
en: “Those who cultivate the peaceful abodes of Brahmā

source: །ངན་སོང་རྣམས་ནི་སྤངས་པས་ན།
en: Abandon unfortunate destinies

source: །རྟག་པར་བརྒྱ་བྱིན་ཚངས་པར་འགྱུར།
en: And, always obtaining the states of Śakra and Brahmā,

source: །དོན་གྱི་ཕན་པ་ནན་ཏན་སྒོམ།
en: Meditate assiduously on the ultimate benefit. “With supernormal powers, bodhisattvas travel through all buddhafields,

source: །མངོན་ཤེས་སངས་རྒྱས་ཞིང་རྒྱུ་བ། །སངས་རྒྱས་བསྙེན་བཀུར་ཆོས་ཀྱང་ཉན།
en: Respectfully honoring the buddhas and listening to the Dharma

source: །རང་བཞིན་མོས་པ་རབ་ཤེས་པས།
en: And, knowing well the natures of aspirations of all,

source: །ཆོས་བཤད་སེམས་ཅན་ཟློས་པར་བྱེད།
en: Teach the Dharma, repeating it to sentient beings.

source: །གཞན་ཡང་བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་བརྒྱད་དང་ལྡན་པའི་ཕྱིར་གཟུངས་དང་། ཐོགས་པ་མེད་པའི་སྤོབས་པ་འཐོབ་པར་འགྱུར་རོ།
en: “Furthermore, girl, because bodhisattvas are endowed with eight qualities, they obtain perfect retention and unimpeded eloquence.

source: ཆོས་ལ་བླ་མར་བྱེད་པའི་ཕྱིར་དང་། མཁན་པོ་དང་། སློབ་དཔོན་ལ་རིམ་གྲོ་བྱེད་པའི་ཕྱིར་དང་། ཆོས་ཡོངས་སུ་གཉེར་བ་ལ་སྐྱོ་བ་མེད་པའི་ཕྱིར་དང་། ཇི་སྐད་ཐོས་པ་བཞིན་དུ་ཡང་དག་པར་སྟོན་པར་བྱེད་པའི་ཕྱིར་དང་། ཆོས་ལ་སེར་སྣ་མི་བྱེད་པའི་ཕྱིར་དང་། གཞན་གྱི་ཉེས་པ་སྒྲོགས་པར་མི་བྱེད་པའི་ཕྱིར་དང་། །ཆོས་སྨྲ་བ་དག་ལ་མཁན་པོ་བཞིན་དུ་གུས་པས་སྲི་ཞུ་བྱེད་པའི་ཕྱིར་དང་། གཞན་གྱི་ཉེས་པ་མི་མཐོང་ཞིང་ཉེས་པ་སྤོང་བར་སྐུལ་བར་བྱེད་པའི་ཕྱིར་ཏེ།
en: They revere the Dharma. They show respect for their preceptors and masters. They are never disheartened with seeking the Dharma. They teach it correctly, in the same way that they were taught. They are not miserly with the Dharma. They do not make public the faults of others. They devotedly pay respect to those who are expounding the Dharma, as if they were their own preceptors. And, without being fixated on the faults of others, they exhort others to abandon their faults.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བརྒྱད་དང་ལྡན་ན་གཟུངས་དང་། ཐོགས་པ་མེད་པའི་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་འཐོབ་པར་འགྱུར་བ་ཞེས་བྱའོ།
en: Because bodhisattvas are endowed with these eight qualities, they obtain perfect retention and unimpeded eloquence.”

source: རྩེ་གཅིག་རྟག་ཏུ་ཆོས་གཉེར་བ།
en: “Those who always one-pointedly seek the Dharma

source: །མཁན་པོ་དགེ་བཤེས་རིམ་གྲོ་བྱེད།
en: Show respect for their preceptors and spiritual friends.

source: །སྡིག་པའི་གྲོགས་པོ་སྤོང་བས་ན།
en: Since they abandon bad companions,

source: །མི་ཟད་གཏེར་འཛིན་ཐོབ་པར་འགྱུར།
en: They obtain an inexhaustible treasure.

source: །མང་ཐོས་ཡོངས་སུ་སྐྱོ་མེད་པར།
en: “Never being disheartened by learning,

source: །རབ་བརྩོན་ཆོས་ནི་གཉེར་བར་བྱེད།
en: They zealously seek the Dharma.

source: །ཇི་སྐད་ཐོས་བཞིན་སྟོན་བྱེད་པས།
en: Because they teach it in the same way that they were taught,

source: །རྙེད་པ་དག་ལ་རེ་ཚོལ་མེད།
en: They do not look for any gain.

source: །སྤོབས་པ་རྣམ་དག་གང་ཐོབ་པ།
en: “Since those who obtain perfect eloquence

source: །འཁོར་མང་དགའ་བར་བྱེད་པས་ན།
en: Gladden numerous assemblies,

source: །ཆོས་སྦྱིན་པ་ལ་རབ་མོས་ཤིང་།
en: They are fully dedicated to giving the Dharma,

source: །སེར་སྣ་ཕྲག་དོག་སྤོང་བར་བྱེད།
en: And abandon miserliness and jealousy.

source: །ཆོས་སྤྱོད་མངོན་པར་ཞེན་མེད་ཅིང་།
en: “They practice the Dharma without attachment,

source: །གཟུངས་ནི་གང་ཞིག་ཐོབ་འགྱུར་བ།
en: And are ones who obtain retention.

source: །ཁྲིམས་སྲུང་རང་ལུས་ལྟ་བས་ན།
en: Because they preserve discipline by watching their own physical behavior,

source: །གཞན་གྱི་ཉེས་སྐྱོན་ཡོང་མི་ཚོལ།
en: They never look for the faults of others.

source: །བྱམས་དང་སྙིང་རྗེ་གནས་གྱུར་ཅིང་།
en: “They sustain their love and compassion,

source: །དུས་མིན་ཚིག་ནི་མི་སྨྲ་བས།
en: And since they do not speak untimely words,

source: །ཐོགས་མེད་སྤོབས་པ་ཐོབ་གྱུར་ནས།
en: They obtain unimpeded eloquence,

source: །སྤྲོ་ཚིག་ཕ་རོལ་ཕྱིན་པ་སྟོན།
en: And show mastery of inspirational speech.

source: །ཆོས་ནི་ལེགས་པར་སྨྲ་བ་ལ།
en: “Those who honor capable Dharma teachers,

source: །མཁན་པོ་བཞིན་དུ་གུས་པར་བྱེད།
en: As if they were preceptors,

source: །སྐྱོན་འཆབ་ཉེས་པ་སྤོང་སྐུལ་བས།
en: And exhort others to abandon their faults, while keeping them to themselves

source: །མི་ཟད་ཀུན་འཛིན་རྒྱ་མཚོ་འཐོབ།
en: Obtain an ocean of inexhaustible treasures.

source: །གཞན་ཡང་བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་རྣམ་པ་བརྒྱད་དང་ལྡན་པའི་ཕྱིར་སངས་རྒྱས་རྣམས་ཀྱི་སྤྱན་སྔར་པད་མ་ལས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ།
en: “Furthermore, girl, because bodhisattvas are endowed with eight qualities, they take miraculous rebirths from lotus buds in the presence of the buddhas.

source: སྲོག་ལ་བབ་པར་གྱུར་ཀྱང་གཞན་གྱི་ཉེས་པ་མི་རྗོད་པ་དང་། སེམས་ཅན་རྣམས་དཀོན་མཆོག་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བར་སྐུལ་བ་དང་། ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་སེམས་ལ་འགོད་པ་དང་། ཚངས་པར་སྤྱོད་པ་ལ་གོས་པ་མེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་དག་བྱས་ནས་པད་མོའི་གདན་ལ་འཇོག་པ་དང་། སེམས་ཅན་མྱ་ངན་བྱེད་པ་དག་གི་མྱ་ངན་སེལ་བར་བྱེད་པ་དང་། ཁེངས་ཤིང་ང་རྒྱལ་བྱེད་པ་དག་གི་མདུན་དུ་རྟག་པར་བདག་ཉིད་དམན་པར་བྱེད་པ་དང་། གཞན་ལ་འཚེ་བར་མི་བྱེད་པ་གང་ཡིན་པའོ།
en: Not speaking of the faults of others, even at the risk of their own lives; exhorting sentient beings to take refuge in the Three Jewels; establishing everyone in the mind set on awakening; having immaculate sublime conduct; making statues of the Thus-Gone One and putting them on lotus seats; dispelling the suffering of sentient beings entangled in sorrow; always humbling themselves in front of the arrogant and proud; and never causing any harm whatsoever to others.”

source: གལ་ཏེ་སྡུག་བསྔལ་གཟིར་གྱུར་ཀྱང་།
en: “Those who, even if pain is inflicted,

source: །ནམ་ཡང་གཞན་གྱི་སྐྱོན་མི་སྨྲ།
en: Never speak of the defects of others,

source: །རྟག་པར་དཀོན་མཆོག་གང་བསྔགས་པ།
en: And always praise the Three Jewels,

source: །སངས་རྒྱས་སྤྱན་སྔར་རྫུས་ཏེ་སྐྱེ།
en: Will be miraculously born in the presence of the buddhas. “Those who cultivate the mind set on awakening

source: །བྱང་ཆུབ་སེམས་ནི་བསྐྱེད་པ་དང་། །ཐམས་ཅད་མཁྱེན་པ་གཉེར་བསྐུལ་ནས།
en: And exhort others to strive for omniscience,

source: །རྟག་པར་ཚངས་པར་གང་སྤྱོད་པ།
en: And who always maintain sublime conduct,

source: །གསེར་གྱིས་སངས་རྒྱས་གཟུགས་བརྒྱན་ཏེ།
en: “Those who cover a buddha statue with gold

source: །རིན་ཆེན་པད་མའི་གདན་ལ་བཞག །སེམས་ཅན་མྱ་ངན་གང་སེལ་བ།
en: And place it on a precious lotus seat, And who dispel the sorrow of beings,

source: །ང་རྒྱལ་བྱེད་པ་དེ་དག་ལ།
en: “Those who, in front of the arrogant,

source: །སློབ་མ་བཞིན་དུ་བདག་དམན་ཞིང་།
en: Humble themselves as if they were their disciples,

source: །གཞན་ལ་གང་ཞིག་མི་འཚེ་བ།
en: And who never harm others,

source: །གཞན་ཡང་བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་རྣམ་པ་བརྒྱད་དང་ལྡན་པར་གྱུར་ན་སྦྱངས་པའི་ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པར་འགྱུར་ཞིང་རྟག་པར་དགོན་པ་ན་གནས་པ་ལ་མོས་པར་འགྱུར་རོ། །བརྒྱད་གང་ཞེ་ན།
en: “Furthermore, girl, when bodhisattvas are endowed with eight qualities, they are consummate in ascetic virtue and always aspire to dwell in seclusion. What are these eight qualities? Having few wants; being content; being fully satisfied with the virtuous Dharma;

source: འདོད་པ་ཆུང་བ་དང་། ཆོག་ཤེས་པ་དང་། དགེ་བའི་ཆོས་ཡོངས་སུ་རྫོགས་པར་གྱུར་པ་དང་། དགེ་བས་བདག་ཉིད་གསོ་བར་བྱེད་པ་དང་། རྟག་པར་འཕགས་པའི་རིགས་ཡོངས་སུ་འཛིན་པ་དང་། འཁོར་བའི་ཉེས་དམིགས་མཐོང་བས་སེམས་ལ་རྟག་པར་སྐྱོ་བ་དང་། རྟག་པར་མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པར་ལྟ་བ་དང་། དད་པ་ཤིན་ཏུ་བརྟན་ཞིང་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པ་གང་ཡིན་པའོ།
en: nourishing themselves with virtue; always maintaining the tradition of the noble ones; always being disenchanted because of seeing the faults of saṃsāra; always contemplating impermanence, suffering, emptiness, and selflessness; and being steadfast in faith, and not following other teachings.”

source: འདོད་པ་ཆུང་ཞིང་ཆོག་ཤེས་པས།
en: “Since bodhisattvas have few wants and are content,

source: །ཆོས་དགའ་དགེ་མང་བདག་ཉིད་གསོ།
en: They delight in the Dharma and nourish themselves with many virtues.

source: །རྟག་པར་འཕགས་རིགས་སྒྲུབ་ལ་མོས།
en: Always aspiring to follow the manners of the noble ones,

source: །འཁོར་བའི་སྐྱོན་མཐོང་སེམས་ལ་སྐྲག །སྦྱངས་པ་དག་ལ་རྟག་མོས་པས།
en: They see the defects of saṃsāra and dread it. “Since they are always dedicated to ascetic virtue,

source: །བསེ་རུ་གཅིག་ལྟར་གྲོགས་ཀྱང་མེད།
en: Like the solitary rhinoceros, they stay without companions.

source: །འདུས་བྱས་སྡུག་བསྔལ་བདག་མེད་ཅེས།
en: Contemplating that all compounded things are suffering and without self,

source: །བློ་ཡིས་རབ་དང་བརྩོན་འགྲུས་གནས།
en: They have minds of complete faith and full of energy.

source: །ཆོས་མཐོང་གཞན་གྱི་རྗེས་མི་འབྲང་།
en: “Having seen the Dharma and not following other teachings,

source: །རྟག་པར་དབེན་གནས་སངས་རྒྱས་བསྔགས།
en: But always dwelling in solitude and praising the Buddha,

source: །སྦྱངས་པས་ཐག་བསྲིངས་གདུང་བ་མེད།
en: With ascetic virtue, they keep a distance and suffer no anguish,

source: །རྩོད་པ་ཉེས་དམིགས་མང་པོ་མེད།
en: Being free from the many troubles of strife.

source: །གཉེན་བཤེས་ཡོངས་སྤངས་བསྔགས་པ་རྗོད།
en: “Having abandoned relatives and friends and refused praise,

source: །དེས་ན་དགོན་པར་གནས་ལ་མོས།
en: They are fully committed to dwelling in seclusion.

source: །གཞན་ཡང་བུ་མོ་བྱང་ཆུབ་སེམས་དཔའི་ནི་ཆོས་རྣམ་པ་བརྒྱད་དང་ལྡན་པའི་ཕྱིར་བདུད་ཀྱི་དཔུང་རབ་ཏུ་ཕམ་པར་བྱེད་དོ།
en: “Furthermore, girl, because bodhisattvas are endowed with eight qualities, they defeat the armies of Māra.

source: ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ལ་ཞུགས་པ་དང་། མཚན་མ་མེད་པ་ལ་མངོན་པར་ཡིད་ཆེས་པ་དང་། སྨོན་པ་མེད་པ་ལ་མངོན་པར་ཡིད་ཆེས་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པར་རབ་ཏུ་ཤེས་པ་དང་། དེ་ལ་ཐེ་ཚོམ་དང་སོམ་ཉི་མེད་པ་དང་། སྐྱེ་བ་མེད་པར་རབ་ཏུ་བཟོད་པ་དང་། ངོ་བོ་ཉིད་མེད་པར་རབ་ཏུ་རྟོགས་པ་དང་། ཐབས་ལ་མཁས་པས་ཆོས་ཐམས་ཅད་ལ་སོ་སོར་རྟོག་ཅིང་དེ་བཞིན་ཉིད་འཇིག་པར་མི་བྱེད་པ་གང་ཡིན་པའོ།
en: fully discerning the uncompounded; not being doubtful or skeptical about it; accepting non-arising; understanding essencelessness; and, by being skillful in means, individually discriminating all phenomena, while knowing unending suchness.”

source: སྟོང་དང་མཚན་མ་མེད་དང་སྨོན་མེད་པ། །རྣམ་ཐར་གསུམ་ཐོབ་བདུད་དཔུང་རབ་ཏུ་འཇོམས།
en: Emptiness, signlessness, and wishlessness—defeat the armies of Māra.

source: །འདུས་བྱས་འདུས་མིན་མཚན་ཉིད་གཉིས་སུ་མེད།
en: As there is no duality between the compounded and uncompounded,

source: །སྐྱེ་མེད་ཐོབ་པས་རྣམ་པར་གྲོལ་བར་འགྱུར། །ཆོས་རྣམས་སྐྱེ་མེད་དེ་ལྟར་གང་བཟོད་པ།
en: They realize non-arising and are completely liberated.

source: །དེ་དག་བདུད་དཔུང་རབ་ཏུ་ཕམ་པར་བྱེད།
en: “They will defeat the armies of Māra When they accept the non-arising of all phenomena thus:

source: །སྐྱེ་བ་མེད་དང་འགག་མེད་འདི་དག་དང་། །ཕུང་པོ་ཁམས་ལ་བདག་མེད་སྒྱུ་མ་འདྲ།
en: ‘These are without arising and without cessation; The aggregates and the elements are without self and like illusions.’

source: །ཆོས་ལ་ངོ་བོ་ཉིད་མེད་རབ་ཏུ་རྟོགས།
en: “They recognize that phenomena have no essence,

source: །དེ་བཞིན་ཉིད་ནི་མི་འཇིག་ཐབས་མཁས་པས།
en: While, by being skillful in means, they do not do away with suchness.

source: །ཆོས་རྣམས་བདུད་ཀྱི་ལས་ཞེས་གང་འབྱེད་པ།
en: The discrimination of phenomena is known to be the work of Māra.

source: །རྣམ་རྟོག་སྤངས་ནས་བདུད་ནི་ཕམ་པར་བྱེད།
en: Having abandoned discrimination, Māra is defeated.

source: །ཐབས་དང་ཤེས་རབ་གཉིས་ཀ་རབ་སྤྱོད་ཅིང་།
en: “Employing both insight and means,

source: །ཡོད་དང་སྟོང་ལ་གནས་པ་མེད་པར་ནི།
en: And not being fixed on existence or emptiness,

source: །དེ་ལྟར་ཆོས་མཆོག་གང་ཞིག་སྒོམ་བྱེད་པ།
en: Those who thus meditate on the supreme Dharma,

source: །ཐབས་མཁས་གཟུགས་ལུས་མཛེས་པ་འཐོབ་པར་འགྱུར།
en: Being skillful in means, will obtain beautiful bodily forms.

source: །གཞན་ཡང་བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ནི། ཆོས་རྣམ་པ་བརྒྱད་དང་ལྡན་པའི་ཕྱིར་བྱང་ཆུབ་དང་ནམ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ།
en: “Furthermore, girl, when bodhisattvas are endowed with eight qualities, they will never be separated from awakening.

source: ཡང་དག་པའི་ལྟ་བས་ལོག་པར་ལྟ་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། ཡང་དག་པའི་དྲན་པས་ལོག་པར་སེམས་པའི་སེམས་ཅན་ལ་སྙིང་བརྩེ་བར་བྱེད་པ་དང་། ཡང་དག་པའི་ངག་གིས་ལོག་པར་སྨྲ་བ་རྣམས་ལ་སྙིང་བརྩེ་བར་བྱེད་པ་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐས་ལོག་པའི་ལས་ཅན་རྣམས་ཡོངས་སུ་སྡུད་པ་དང་། ཡང་དག་པའི་རྩོལ་བས་ལོག་པར་རྩོལ་བ་རྣམས་ཡོངས་སུ་ཟློག་པ་དང་ཡང་དག་པའི་འཚོ་བས་ལོག་པར་འཚོ་བའི་སེམས་ཅན་རྣམས་སྤོང་བར་མི་བྱེད་པ་དང་། ཡང་དག་པའི་རྟོག་པས་ལོག་པར་ཡིད་ལ་བྱེད་པ་སྤོང་བར་བྱེད་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་གྱིས་ལོག་པའི་ཏིང་ངེ་འཛིན་ལ་གནས་པ་དག་བསླང་ནས་གོང་དུ་རྩོལ་དུ་གཞུག་པ་གང་ཡིན་པའོ།
en: With right view, they ripen sentient beings who have wrong views. With right mindfulness, they act compassionately toward sentient beings who have wrong intention. With right speech, they act compassionately toward those who speak wrongly. With right action, they draw in those engaged in wrongdoings. With right effort, they stop those engaged in wrong pursuits. With right livelihood, they do not abandon sentient beings engaged in wrong livelihoods. With right thought, they make them abandon wrong thinking. With right absorption, they wake those who are stuck in wrong absorption, and make them strive higher.”

source: ཡང་དག་ལྟ་དང་གང་ལྡན་པ།
en: “Those who are endowed with right view

source: །ལོག་ལྟ་དེ་དག་སྨིན་པར་བྱེད།
en: Bring those with wrong views to maturity.

source: །རྟག་པར་ཡང་དག་དྲན་སྒོམ་པ།
en: Constantly cultivating right mindfulness,

source: །ལོག་སེམས་དག་ལ་བརྩེ་བར་བྱེད།
en: They act compassionately toward those with wrong intention.

source: །རྣམ་དག་ཡང་དག་དག་གིས་ནི།
en: “Those who have right speech

source: །ལོག་སྨྲ་རྣམས་ལ་བརྩེ་བར་བྱེད།
en: Act compassionately toward those who speak wrongly.

source: །ཡང་དག་ལས་མཐའ་གནས་པ་ཡིས།
en: Being established in right action,
